app/views/sallary_structures/_form.html.erb

          <div class="col-md-3">
            <%= f.input :sallary_component_detail_id,:collection => SallaryComponentDetail.all,:label_method => :name,:value_method => :id,:label => "Component" ,:include_blank => true %>
---
SELECT `sallary_component_details`.* FROM `sallary_component_details`