app/views/employees/_form.html.erb

        <div class="col-xs-3">
         <%= ud.input :user_type_id,:collection => UserType.all,:label_method => :name,:value_method => :id,:label => "User Type" ,:include_blank => true %>
---
SELECT `user_types`.* FROM `user_types`
SELECT `users`.* FROM `users`

            <div class="col-xs-3">
              <%= ud.input :gender, as: :select, include_blank: false, collection: Employee::GENDERS.map { |g| [g.titleize, g] } %>
---
SELECT `employees`.* FROM `employees`

            <div class="col-xs-3">
              <%= ud.input :blood_group_id,:collection => BloodGroup.all,:label_method => :name,:value_method => :id,:label => "Blood Group" ,:include_blank => true %>
---
SELECT `blood_groups`.* FROM `blood_groups`

            <div class="col-xs-3">
            <%= ud.input :department_id,:collection => Department.all,:label_method => :name,:value_method => :id,:label => "Department" ,:include_blank => true %>
---
SELECT `departments`.* FROM `departments`

          <div class="col-xs-3">
            <%= ud.input :designation_id,:collection => Designation.all,:label_method => :name,:value_method => :id,:label => "Designation" ,:include_blank => true %>
---
SELECT `designations`.* FROM `designations`

          <div class="col-xs-3">
            <%= ud.input :grade_id,:collection => Grade.all,:label_method => :name,:value_method => :id,:label => "Grade" ,:include_blank => true %>
---
SELECT `grades`.* FROM `grades`

          <div class="col-xs-3">
            <%= ud.input :religion_id,:collection => Religion.all,:label_method => :name,:value_method => :id,:label => "Religion" ,:include_blank => true %>
---
SELECT `religions`.* FROM `religions`