app/views/users/_form.html.erb

SELECT `blood_groups`.* FROM `blood_groups`
---
            <div class="col-xs-3">
              <%= ud.input :blood_group, as: :select, include_blank: false, collection: BloodGroup.all.map { |g| [g.name.titleize, g] } %>

SELECT `departments`.* FROM `departments`
---
            <div class="col-xs-3">
            <%= ud.input :department,:collection => Department.all,:label_method => :name,:value_method => :id,:label => "Department" ,:include_blank => false %>

SELECT `designations`.* FROM `designations`
---
          <div class="col-xs-3">
            <%= ud.input :designation,:collection => Designation.all,:label_method => :name,:value_method => :id,:label => "Designation" ,:include_blank => false %>

SELECT `grades`.* FROM `grades`
---
          <div class="col-xs-3">
            <%= ud.input :grade,:collection => Grade.all,:label_method => :name,:value_method => :id,:label => "Grade" ,:include_blank => false %>

SELECT `religions`.* FROM `religions`
---
          <div class="col-xs-3">
            <%= ud.input :religion,:collection => Religion.all,:label_method => :name,:value_method => :id,:label => "Religion" ,:include_blank => false %>

SELECT `user_types`.* FROM `user_types`
---
          <div class="col-xs-3">
           <%= ud.input :user_type,:collection => UserType.all,:label_method => :name,:value_method => :id,:label => "User Type" ,:include_blank => false %>