app/controllers/blood_groups_controller.rb

SELECT `blood_groups`.* FROM `blood_groups`
---
  def index
    @blood_groups = BloodGroup.all

INSERT INTO `blood_groups` (`name`, `created_at`, `updated_at`) VALUES ('A+ve', '2015-06-26 10:17:15', '2015-06-26 10:17:15')
---
  def create
    @blood_group = BloodGroup.new(blood_group_params)

    respond_to do |format|
      if @blood_group.save