app/controllers/departments_controller.rb

SELECT `departments`.* FROM `departments`
---
  def index
    @departments = Department.all

INSERT INTO `departments` (`name`, `created_at`, `updated_at`) VALUES ('Management', '2015-06-28 05:13:40', '2015-06-28 05:13:40')
---
  def create
    @department = Department.new(department_params)

    respond_to do |format|
      if @department.save