app/controllers/designations_controller.rb

  def index
    @designations = Designation.all
---
SELECT `designations`.* FROM `designations`