app/controllers/employees_controller.rb

SELECT `employees`.* FROM `employees`
---
  def index
    @employees = Employee.all

INSERT INTO `employees` (`emp_id`, `email`, `user_name`, `created_at`, `updated_at`) VALUES ('tech12', 'San@gmail.com', 'San', '2015-06-28 04:41:10', '2015-06-28 04:41:10')
INSERT INTO `users` (`email`, `user_name`, `encrypted_password`, `created_at`, `updated_at`) VALUES ('test@test.com', 'A1', '$2a$10$TdC3howREbzzatlawvPhcOccY/2JHWlbFIkooRDjOho3J2XsVTX3O', '2015-06-27 15:04:06', '2015-06-27 15:04:06')
INSERT INTO `user_details` (`first_name`, `last_name`, `gender`, `official_phone`, `official_mobile`, `fax`, `pan_no`, `blood_group_id`, `department_id`, `designation_id`, `grade_id`, `religion_id`, `user_type_id`, `employee_id`, `created_at`, `updated_at`) VALUES ('SAN', 'SUN', 'male', '090909090909', '556757557657', 'ljhkj', 'faf', 1, 1, 1, 1, 5, 2, 1, '2015-06-28 04:41:10', '2015-06-28 04:41:10')
INSERT INTO `user_work_details` (`login`, `logout`, `employee_id`, `login_time`, `logout_time`, `total_time`, `created_at`, `updated_at`) VALUES ('2015-06-28', '2015-06-28', 1, '2015-06-28 08:41:17', '2015-06-28 10:04:37', 83.3333335931, '2015-06-28 10:04:37', '2015-06-28 10:04:37')
---
  def create
    @employee = Employee.new(employee_params)
    respond_to do |format|
      if @employee.save
        @user = User.new(email: employee_params[:email],user_name: employee_params[:user_name])
        @user.password = '12345678'
        @user.save
        @employee.update_attributes(user_id: @user.id)
        #test data
        UserWorkDetail.create_work_detail(Time.now,Time.now,(Time.now - 5000),Time.now,@employee.id)

SELECT  `employees`.* FROM `employees` WHERE `employees`.`id` = 1 LIMIT 1
---
  def set_employee
    @employee = Employee.find(params[:id])