app/controllers/grades_controller.rb

  def index
    @grades = Grade.all
---
SELECT `grades`.* FROM `grades`