app/controllers/holidays_controller.rb

  def index
    @holidays = Holiday.all
---
SELECT `holidays`.* FROM `holidays`