app/controllers/religions_controller.rb

  def index
    @religions = Religion.all
---
SELECT `religions`.* FROM `religions`