app/controllers/sallary_component_details_controller.rb

SELECT `sallary_component_details`.* FROM `sallary_component_details`
---
  def index
    @sallary_component_details = SallaryComponentDetail.all

INSERT INTO `sallary_component_details` (`name`, `print_name`, `component_type`, `amt_per`, `status`, `position`, `created_at`, `updated_at`) VALUES ('Basic Pay', 'Basic', 'Earnings', 'amount', 'active', 1, '2015-06-28 11:22:19', '2015-06-28 11:22:19')
---
  def create
    @sallary_component_detail = SallaryComponentDetail.new(sallary_component_detail_params)

    respond_to do |format|
      if @sallary_component_detail.save

SELECT  `sallary_component_details`.* FROM `sallary_component_details` WHERE `sallary_component_details`.`id` = 1 LIMIT 1
---
    def set_sallary_component_detail
      @sallary_component_detail = SallaryComponentDetail.find(params[:id])