app/controllers/sallary_structures_controller.rb

SELECT `sallary_structures`.* FROM `sallary_structures`
---
  def index
    # @employee = Employee.find(params[:employee_id])
    # @sallary_structures = @employee.sallary_structures
    @sallary_structures = SallaryStructure.all

SELECT  `employees`.* FROM `employees` WHERE `employees`.`id` = 1 LIMIT 1
---
  def employee_sallary_structure
    @employee = Employee.find(params[:employee_id])

INSERT INTO `sallary_structures` (`amount`, `sallary_component_detail_id`, `employee_id`, `created_at`, `updated_at`) VALUES (1500.0, 2, 1, '2015-06-28 11:31:23', '2015-06-28 11:31:23')
SELECT  `employees`.* FROM `employees` WHERE `employees`.`id` = 2 LIMIT 1
---
  def create
    @sallary_structure = SallaryStructure.new(sallary_structure_params)

    respond_to do |format|
      if @sallary_structure.save
        @employee = Employee.find(sallary_structure_params[:employee_id])

SELECT  `sallary_structures`.* FROM `sallary_structures` WHERE `sallary_structures`.`id` = 2 LIMIT 1
---
    def set_sallary_structure
      @sallary_structure = SallaryStructure.find(params[:id])