app/controllers/user_work_details_controller.rb

SELECT `user_work_details`.* FROM `user_work_details`
---
  def index
    @user_work_details = UserWorkDetail.all