app/controllers/user_details_controller.rb

SELECT `user_details`.* FROM `user_details`
---
  def index
    @user_details = UserDetail.all