app/controllers/user_types_controller.rb

  def index
    @user_types = UserType.all
---
SELECT `user_types`.* FROM `user_types`